Enza.UTM.DataAccess.Services/Requests/FillPlatesInLIMSRequest.st

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://contract.enzazaden.com/LIMS/v1" xmlns:fil="http://schemas.datacontract.org/2004/07/FillPlates">
  <soapenv:Header/>
  <soapenv:Body>
    <v1:FillPlatesWrapper>
      <fil:FillPlatesInLIMS>
        <fil:LimsPlateplanID>$Model.LimsPlatePlanID$</fil:LimsPlateplanID>
        <fil:RequestID>$Model.RequestID$</fil:RequestID>
        <fil:CropCode>$Model.CropCode$</fil:CropCode>
        <fil:Plates>
          $Model.Plates:{plate|
          <fil:Plate>
            <fil:LimsPlateID>$plate.LimsPlateID$</fil:LimsPlateID>
            <fil:LimsPlateName>$plate.LimsPlateName$</fil:LimsPlateName>
            <fil:Markers>
              $plate.Markers:{marker|
              <fil:Marker>
                <fil:MarkerNr>$marker.MarkerNr$</fil:MarkerNr>
                <fil:MarkerName>$marker.MarkerName$</fil:MarkerName>
              </fil:Marker>
              }$
            </fil:Markers>
            <fil:Wells>
              $plate.Wells:{well|
              <fil:Well>
                <fil:PlateColumn>$well.PlateColumn$</fil:PlateColumn>
                <fil:PlateRow>$well.PlateRow$</fil:PlateRow>
                <fil:PlantNr>$well.PlantNr$</fil:PlantNr>
                <fil:PlantName>$well.PlantName$</fil:PlantName>
                <fil:BreedingStationCode>$well.BreedingStationCode$</fil:BreedingStationCode>
              </fil:Well>
              }$
            </fil:Wells>
          </fil:Plate>
          }$
        </fil:Plates>
      </fil:FillPlatesInLIMS>
    </v1:FillPlatesWrapper>
  </soapenv:Body>
</soapenv:Envelope>